app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("post_id", "body", "created_at", "updated_at") VALUES (1, 'Body comment', '2025-07-08 21:03:28.283912', '2025-07-08 21:03:28.283912') RETURNING "id"

    def set_comment
      @comment = Comment.find(params.expect(:id))
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 1 LIMIT 1